package ru.liga.translateService.dictionary;

import lombok.Getter;

import java.util.HashMap;
import java.util.Map;

public class DictionaryF {
    @Getter
    private final Map<String, String> F_CHANGE_MAP = new HashMap<String, String>(){{
        put("Агафья","Агаѳья");
        put("Анфим","Анѳимъ");
        put("Афанасий","Аѳанасій");
        put("Афина","Аѳина");
        put("Варфоломей","Варѳоломей");
        put("Голиаф","Голіаѳъ");
        put("Евфимий","Евѳимій");
        put("Марфа","Марѳа");
        put("Матфей","Матѳей");
        put("Мефодий","Меѳодій");
        put("Нафанаил","Наѳанаилъ");
        put("Парфенон","Парѳенонъ");
        put("Пифагор","Пиѳагоръ");
        put("Руфь","Руѳь");
        put("Саваоф","Саваоѳъ");
        put("Тимофей","Тимоѳей");
        put("Эсфирь","Эсѳирь");
        put("Иудифь","Іудиѳь");
        put("Фаддей","Ѳаддей");
        put("Фекла","Ѳекла");
        put("Фемида","Ѳемида");
        put("Фемистокл","Ѳемистоклъ");
        put("Феодор","Ѳеодоръ");
        put("Фёдор","Ѳёдоръ");
        put("Федя","Ѳедя");
        put("Феодосий","Ѳеодосій");
        put("Федосий","Ѳедосій");
        put("Феодосия","Ѳеодосія");
        put("Феодот","Ѳеодотъ");
        put("Федот","Ѳедотъ");
        put("Феофан","Ѳеофанъ");
        put("Феофил","Ѳеофилъ");
        put("Ферапонт","Ѳерапонтъ");
        put("Фома","Ѳома");
        put("Фоминична","Ѳоминична");
    }};
}
