package ru.liga.translateService.dictionary;

import lombok.Getter;

import java.util.HashMap;
import java.util.Map;

public class DictionaryF {
    @Getter
    private final Map<String, String> F_CHANGE_MAP = new HashMap<String, String>() {{
        put("Агафья", "Агаѳья");
        put("Анфим", "Анѳим");
        put("Афанасий", "Аѳанасий");
        put("Афина", "Аѳина");
        put("Варфоломей", "Варѳоломей");
        put("Голиаф", "Голиаѳ");
        put("Евфимий", "Евѳимий");
        put("Марфа", "Марѳа");
        put("Матфей", "Матѳей");
        put("Мефодий", "Меѳодий");
        put("Нафанаил", "Наѳанаил");
        put("Парфенон", "Парѳенон");
        put("Пифагор", "Пиѳагор");
        put("Руфь", "Руѳь");
        put("Саваоф", "Саваоѳ");
        put("Тимофей", "Тимоѳей");
        put("Эсфирь", "Эсѳирь");
        put("Иудифь", "Иудиѳь");
        put("Фаддей", "Ѳаддей");
        put("Фекла", "Ѳекла");
        put("Фемида", "Ѳемида");
        put("Фемистокл", "Ѳемистокл");
        put("Феодор", "Ѳеодор");
        put("Фёдор", "Ѳёдор");
        put("Федя", "Ѳедя");
        put("Феодосий", "Ѳеодосий");
        put("Федосий", "Ѳедосий");
        put("Феодосия", "Ѳеодосия");
        put("Феодот", "Ѳеодот");
        put("Федот", "Ѳедот");
        put("Феофан", "Ѳеофан");
        put("Феофил", "Ѳеофил");
        put("Ферапонт", "Ѳерапонт");
        put("Фома", "Ѳома");
        put("Фоминична", "Ѳоминична");
    }};
}
